[
    {
        "id": "project-001",
        "title": "Skyline Tower Renovation",
        "type": "Construction",
        "features": ["Laying of foundation using reinforced concrete structures to ensure the stability of the high-rise building.", "Installation of a metal frame with innovative fast-assembly technologies.", "Implementation of energy-efficient facade panels with low thermal conductivity glass", "Integration of modern ventilation and air conditioning systems with automated climate control.", "Installation of silent elevators equipped with the latest safety systems.", "Arrangement of an observation deck with panoramic glazing on the upper floors.", "Development and implementation of a smart building system to enhance residents' comfort and energy saving."],
        "text": "The Skyline Tower project was a challenge for our team due to the client's high demands for innovation and environmental safety. The building is intended to become a city landmark, so we paid special attention to the facade: energy-efficient glazing and lightweight yet durable panels not only ensure a comfortable indoor climate but also significantly reduce energy consumption. \n\n A particular point of pride was the implementation of a “smart building” system that automatically regulates lighting, ventilation, and security, taking into account residents' preferences and weather conditions. On the upper floors, an observation deck with panoramic glazing was equipped, making Skyline Tower a popular place for relaxation and tourism. \n\n Thanks to the use of modern frame assembly technologies, we were able to shorten construction timelines without compromising quality, which was critical for the client. The entire project reflects our firm's commitment to creating not just buildings, but spaces for living in the future.",
        "image": "./assets/img/projects/project-1.webp"
    },
    {
        "id": "project-002",
        "title": "Central Park Business Center",
        "type": "Renovation",
        "features": ["Complete overhaul of the building's facade using modern aluminum composite panels and energy-efficient glazing.", "Reconstruction of lobby and common areas with premium finishes and expanded natural lighting zones.", "Full replacement of outdated HVAC systems with smart, energy-saving equipment.", "Redesign of office floor layouts for greater flexibility and tenant customization.", "Installation of high-speed elevators with touchless access and enhanced security features.", "Upgrade of electrical and IT infrastructure to meet the demands of modern businesses.", "Landscaping of surrounding area, including green zones, seating areas, and improved pedestrian access."],
        "text": "The renovation of Central Park Business Center was driven by the client's ambition to turn a dated office complex into a premium, future-ready commercial hub. Located in a key area near the city's central park, the building's potential was clear—but it needed a full transformation to meet the expectations of modern businesses and tenants. \n\n We began by redesigning the entire facade, replacing old cladding with sleek, contemporary panels and energy-efficient glass. The lobby and common areas were reimagined with warm, high-end materials and opened up to bring in more natural light, creating a welcoming and professional first impression. \n\n Inside, we modernized every floor: the office spaces were reconfigured to allow maximum flexibility for tenants, from startups to large corporations. All technical systems were updated, including HVAC, elevators, and the digital backbone of the building, preparing it for the needs of today's tech-driven workplace. \n\\ Additionally, we paid close attention to the exterior environment—adding landscaped zones and improving access routes to blend business functionality with a calm, green setting. The result is a striking example of how thoughtful renovation can breathe new life into a commercial property.",
        "image": "./assets/img/projects/project-2.webp"
    },
    {
        "id": "project-003",
        "title": "Riverside Private Estate",
        "type": "Landscaping",
        "features": ["Creation of a multi-level terraced landscape design along the riverbank to prevent erosion and enhance visual depth.", "Planting of native trees and shrubs to blend the estate with the surrounding natural environment.", "Installation of a custom-built wooden deck and outdoor lounge area with river views.", "Construction of decorative stone pathways and lighting for safe and scenic evening walks.", "Development of a self-sustaining irrigation system with moisture sensors and seasonal automation.", "Integration of a private garden zone with aromatic herbs, perennials, and flowering bushes.", "Addition of a small decorative pond with natural filtration and aquatic plants."],
        "text": "Riverside Private Estate presented a rare opportunity: to shape a landscape that both complements and enhances the beauty of its natural riverfront setting. Our team was brought in to turn a raw, uneven terrain into a refined and immersive outdoor space—both elegant and practical. \n\n One of the major challenges was the sloped riverbank. We implemented a multi-tiered terracing system that not only stabilizes the soil but also introduces depth and structure to the landscape. Local flora was carefully selected and planted to ensure harmony with the surrounding ecosystem while also requiring minimal maintenance. \n\n The heart of the design is a custom wooden deck with unobstructed river views, serving as a peaceful retreat for the homeowners. Carefully laid stone paths, ambient lighting, and a lush mix of greenery guide visitors through the estate, making each walk a sensory experience. We also included a small pond and herb garden to bring texture, fragrance, and a sense of life to the space. \n\n Thanks to sustainable design principles and smart automation, the landscape remains vibrant throughout the seasons with minimal intervention—offering both natural beauty and modern convenience.",
        "image": "./assets/img/projects/project-3.webp"
    },
    {
        "id": "project-004",
        "title": "Aurora Office Hub",
        "type": "Interior Fit-Out",
        "features": ["Zoning and layout development for open-space offices, private meeting rooms, and quiet work zones.", "Installation of modular glass partitions with acoustic insulation for flexible space use.", "Design and furnishing of a multifunctional reception area with custom-built elements.", "Integration of biophilic design: indoor greenery, vertical gardens, and natural materials.", "Custom lighting system tailored to different work zones, including daylight-mimicking LEDs.", "Installation of ergonomic furniture and height-adjustable desks throughout the workspace.", "Implementation of smart controls for lighting, climate, and access, all managed via a central system."],
        "text": "Aurora Office Hub aimed to become more than just another workplace—it was envisioned as a dynamic environment that supports productivity, flexibility, and well-being. Our team was responsible for the full interior fit-out, transforming a raw concrete shell into a cutting-edge office tailored to the needs of a modern, fast-paced business. \n\n We began with a detailed space planning process to ensure that every square meter served a purpose—from collaborative open zones to enclosed meeting rooms and individual quiet areas. Modular glass partitions offered both visual openness and acoustic privacy, allowing teams to work together without distractions. \n\n Biophilic elements played a key role in the design. We integrated living walls and natural textures, creating a calm, inspiring atmosphere that improves air quality and boosts employee satisfaction. The fit-out also included custom lighting setups that support focus and reduce eye strain, as well as smart systems for adjusting climate and access across the office with minimal effort. \n\n Aurora Office Hub now combines high-tech functionality with human-centered design—an environment built not only for working, but for thriving.",
        "image": "./assets/img/projects/project-4.webp"
    },
    {
        "id": "project-005",
        "title": "Harmony Shopping Mall",
        "type": "Reconstruction",
        "features": ["Full modernization of the building's facade with ventilated panels and dynamic LED lighting.", "Reconfiguration of interior layout to improve foot traffic flow and tenant visibility.", "Replacement of all escalators and elevators with high-capacity, energy-efficient models.", "Renovation of food court and common areas with updated finishes, seating, and natural light features.", "Upgrade of all mechanical and electrical systems, including HVAC and fire safety.", "Installation of digital navigation kiosks and centralized mall management system.", "Revamp of exterior plaza with seating, green zones, and improved pedestrian access."],
        "text": "The reconstruction of Harmony Shopping Mall was a large-scale transformation aimed at giving a second life to a once-popular but outdated retail destination. The client's goal was clear: bring the mall in line with modern retail standards while creating a vibrant, visitor-friendly environment that would attract both new tenants and returning shoppers. \n\n We started by completely redesigning the building's facade, incorporating ventilated panels and programmable LED lighting to give the mall a striking night-time presence. Inside, the layout was optimized to enhance customer circulation, improve shop visibility, and create clear zoning for fashion, electronics, leisure, and food. \n\n Key infrastructure systems—like HVAC, fire safety, and vertical transportation—were fully replaced with high-performance, energy-efficient alternatives. We also focused heavily on the user experience: the food court was renovated with natural materials, skylights, and flexible seating arrangements, while digital directories and smart management systems improved navigation and operations. \n\n Outside, we revitalized the public plaza, adding greenery, shaded seating, and safe pedestrian routes, making the mall not just a shopping center, but a community space. Harmony Mall is now a modern retail hub that successfully balances commercial efficiency with comfort and experience.",
        "image": "./assets/img/projects/project-5.webp"
    },
    {
        "id": "project-006",
        "title": "Hillside Family Cottage",
        "type": "Extension",
        "features": ["Design and construction of a two-story extension seamlessly blending with the original cottage architecture.", "Reinforcement of the existing foundation to support the new structure safely on the hillside terrain.", "Addition of a spacious living area with large panoramic windows offering scenic views.", "Installation of eco-friendly insulation and energy-efficient windows to improve thermal comfort.", "Expansion of the kitchen and dining area with modern fixtures and open-plan layout.", "Creation of an outdoor terrace with direct access from the new living space.", "Landscaping adjustments to accommodate the extension while preserving natural hillside vegetation."],
        "text": "The Hillside Family Cottage extension was a delicate project focused on expanding living space without compromising the charm and character of the original home. Situated on a sloping site with beautiful natural surroundings, the extension had to blend harmoniously with the existing structure while addressing the challenges posed by the terrain. \n\n Our team reinforced the foundation to ensure stability on the hillside and designed a two-story addition featuring large panoramic windows that maximize natural light and capture breathtaking views. Energy efficiency was a priority, so we incorporated advanced insulation and high-performance glazing to enhance comfort throughout the year. \n\n Inside, the extension expanded the kitchen and dining areas into an open-plan layout, perfect for family gatherings and entertaining guests. An outdoor terrace was added, providing seamless indoor-outdoor living and a space to enjoy the serene environment. Throughout the process, care was taken to preserve the natural vegetation around the site, maintaining the cottage's connection to its beautiful hillside setting. \n\n This project exemplifies how thoughtful design and engineering can extend a beloved family home while respecting its environment and spirit.",
        "image": "./assets/img/projects/project-6.webp"
    }
]