[
    {
        "id": "service-001",
        "title": "Building Construction",
        "description": "This involves various stages like planning, design",
        "text": "From breaking ground to final finishes, we manage the full construction process with precision and professionalism. Our team coordinates every stage to ensure smooth progress and consistent quality on-site. We work with trusted suppliers, proven materials, and skilled crews to deliver buildings that are durable, functional, and built to last — whether it's a home, commercial space, or large-scale facility.",
        "image": "./assets/img/building-construction.webp"
    },
    {
        "id": "service-002",
        "title": "Building Design",
        "description": "Creating custom building designs that meet your needs. We focus on functionality and aesthetic appeal",
        "text": "Our approach to building design begins with understanding how you live, work, or use the space. We translate those needs into architectural concepts that are efficient, sustainable, and ready for construction. By combining technical expertise with creative thinking, we develop layouts and design solutions that support your goals while staying within budget and regulatory requirements. Every project is uniquely shaped to match your context and future plans.",
        "image": "./assets/img/building-design.webp"
    },
    {
        "id": "service-003",
        "title": "Construction Management",
        "description": "Overseeing the construction process from start to finish, ensuring quality and timely completion",
        "text": "We act as your on-site partner, coordinating teams, schedules, and resources to keep your project running efficiently. Our proactive approach helps identify risks early and solve issues before they affect timelines or budgets. From contractor supervision to quality control and progress reporting, we handle the details so you can stay focused on the bigger picture. With us, your project stays on track — and built to the highest standards.",
        "image": "./assets/img/construction-management.webp"
    },
    {
        "id": "service-004",
        "title": "Renovation Services",
        "description": "Transform your existing space with professional renovation. We update and improve interiors to match your vision",
        "text": "Whether it's a full interior overhaul or targeted upgrades, our renovation team brings new life to tired spaces. We carefully assess existing conditions and develop solutions that maximize comfort, functionality, and style. From structural changes to fine finishes, every detail is handled with precision and care. We work closely with you throughout the process to ensure the final result feels both refreshed and truly yours.",
        "image": "./assets/img/renovation-services.webp"
    },
    {
        "id": "service-005",
        "title": "Structural Engineering",
        "description": "Providing expert structural design and analysis for safe, durable buildings that stand the test of time",
        "text": "Our engineers deliver precise calculations and tailored structural solutions that support both architectural intent and long-term performance. We ensure that every beam, column, and connection meets safety codes and project requirements. With experience across residential, commercial, and industrial sectors, we help bring complex designs to life — reliably and efficiently. The result: structures built to perform under pressure, season after season.",
        "image": "./assets/img/structural-engineering.webp"
    },
    {
        "id": "service-006",
        "title": "Project Planning",
        "description": "Efficiently planning every phase of construction. We ensure everything is mapped out for a smooth project execution",
        "text": "We carefully organize each phase of your construction project to ensure clear timelines, resource allocation, and risk management. Our detailed plans help prevent delays and keep the workflow seamless from start to finish. By coordinating schedules, budgets, and stakeholders early on, we create a solid foundation for successful project execution and timely delivery.",
        "image": "./assets/img/project-planning.webp"
    }
]